Revit 2026 API

# FailureDefinitionAccessorGetId Method

---

Retrieves the unique identifier of the FailureDefinition.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureDefinitionId GetId()
```
```vb
Public Function GetId As FailureDefinitionId
```
```cpp
public:
FailureDefinitionId^ GetId()
```
```fsharp
member GetId : unit -> FailureDefinitionId
```

#### Return Value

FailureDefinitionId The unique identifier of the FailureDefinition.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The FailureDefinitionAccessor has not been properly initialized. |

#### Reference

FailureDefinitionAccessor Class

Autodesk.Revit.DB Namespace